In [1]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'2.3.3'

In [6]:
#create pandas series
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
s1= pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
#create dataframe
data=np.random.randint(10,size=(5,4))
data

array([[8, 4, 0, 8],
       [2, 7, 3, 9],
       [1, 3, 0, 5],
       [6, 8, 6, 7],
       [7, 8, 8, 8]], dtype=int32)

In [14]:
df = pd.DataFrame(data=data, index=['r1','r2','r3','r4','r5'],columns=['c1','c2','c3','c4'])
df

    c1  c2  c3  c4
r1   8   4   0   8
r2   2   7   3   9
r3   1   3   0   5
r4   6   8   6   7
r5   7   8   8   8

In [15]:
df['c2']

r1    4
r2    7
r3    3
r4    8
r5    8
Name: c2, dtype: int32

In [16]:
df[['c1','c2']]

    c1  c2
r1   8   4
r2   2   7
r3   1   3
r4   6   8
r5   7   8

In [17]:
df.loc['r1']

c1    8
c2    4
c3    0
c4    8
Name: r1, dtype: int32

In [18]:
df.loc[['r1','r2']]

    c1  c2  c3  c4
r1   8   4   0   8
r2   2   7   3   9

In [19]:
#create dataframe with dictionary
data={'Name':['poojitha','giduthoori','laya','sathish'], 'age':[12,13,14,15], 'gender':['f','f','f','m']}
df = pd.DataFrame(data, index=['a','b','c','d'])
df

         Name  age gender
a    poojitha   12      f
b  giduthoori   13      f
c        laya   14      f
d     sathish   15      m

In [20]:
df.loc[['a','b']]

         Name  age gender
a    poojitha   12      f
b  giduthoori   13      f

In [22]:
#read csv file
data = pd.read_csv(r'C:\Users\DELL\Desktop\AICW.ISTS\EDA\data.csv')
data

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [ ]:
data.columns